espressif/esp-idf/tools/test_apps/system/panic/sdkconfig.ci.memprot_spiram_xip_esp32s3
# Restricting to ESP32S3
CONFIG_IDF_TARGET="esp32s3"

# Enabling memory protection
CONFIG_ESP_SYSTEM_MEMPROT_FEATURE=y
CONFIG_ESP_SYSTEM_MEMPROT_FEATURE_LOCK=y

# Enabling DCACHE
CONFIG_ESP32S3_DATA_CACHE_16KB=y

# Enable memprot test
CONFIG_TEST_MEMPROT=y

# Enable SPIRAM to check the alignment gap's memory protection
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
